---
kind: method
id: M:Autodesk.Revit.DB.Structure.RebarBendData.Dispose
source: html/591383a9-1c04-0c9a-07df-78d905caacf3.htm
---
# Autodesk.Revit.DB.Structure.RebarBendData.Dispose Method

Releases all resources used by the RebarBendData

## Syntax (C#)
```csharp
public void Dispose()
```